export enum EErrorText {
  minLength2 = 'Минимальная длина: 2 символа',
  maxLength15 = 'Максимальная длина: 15 символов',
  requiredField = 'Поле обязательно для заполнения',
  passwordMatch = 'Введенные пароли не совпадают',
  passwordSpace = 'Недопустимый формат! Ваш пароль содержит пробел',
  passwordFormat = 'Недопустимый формат! Пароль должен быть не короче 8 символов, иметь хотя бы одну заглавную и строчную буквы, одну цифру',
  textFormat = 'Недопустимый формат! Пожалуйста, используйте буквы',
  emailFormat = 'Недопустимый формат!',
  postalCode = 'Индекс содержит 6 цифр',
  dateInvalid = 'Недопустимый формат',
  dateToYoung = 'Вы слишком молоды',
  dateOutOfLimit = 'Недопустимая дата',
  passwordMinLength = 'Минимальная длина: 8 символа'
}
